namespace KrokCompiler.Lexer
{
    public enum State
    {
        // 0. Початковий стан
        q0,

        // 1. Проміжні стани (в процесі розпізнавання, НЕ заключні)
        q_id,               // Читаємо ідентифікатор (напр. "my_v")
        q_num_int,          // Читаємо ціле число (напр. "123")
        q_num_real_pre,     // Щойно побачили '.', чекаємо на цифри (напр. ".")
        q_num_real_post,    // Читаємо дробову частину (напр. "123.4")
        q_str,              // Читаємо рядок (напр. "\"hello")
        q_slash,            // Щойно побачили '/', може бути коментар
        q_comment,          // Ігноруємо коментар
        q_assign,           // Щойно побачили '=', може бути '=='
        q_lt,               // Щойно побачили '<', може бути '<='
        q_gt,               // Щойно побачили '>', може бути '>='
        q_not,              // Щойно побачили '!', має бути '!='

        // 2. Заключні стани (Fstar - потребують повернення 'other' символу)
        q_id_F,             // Розпізнано id (напр. "my_var")
        q_int_F,            // Розпізнано int_const (напр. "123")
        q_real_F,           // Розпізнано real_const (напр. "123.4")
        q_div_F,            // Розпізнано op_div (символ '/')
        q_assign_F,         // Розпізнано op_assign (символ '=')
        q_lt_F,             // Розпізнано op_lt (символ '<')
        q_gt_F,             // Розпізнано op_gt (символ '>')
        q_not_F,            // Помилка! Розпізнано '!' без '='

        // 3. Заключні стани (звичайні - БЕЗ повернення)
        q_str_F,            // Розпізнано string_const (завершився на '"')
        q_eq_F,             // Розпізнано op_eq (символи '==')
        q_le_F,             // Розпізнано op_le (символи '<=')
        q_ge_F,             // Розпізнано op_ge (символи '>=')
        q_neq_F,            // Розпізнано op_neq (символи '!=')

        // 4. Заключні стани для ОДНОСИМВОЛЬНИХ токенів 
        q_add_F,            // +
        q_sub_F,            // -
        q_mul_F,            // *
        q_pow_F,            // ^
        q_lparen_F,         // (
        q_rparen_F,         // )
        q_lbrace_F,         // {
        q_rbrace_F,         // }
        q_comma_F,          // ,
        q_semicolon_F,      // ;
        q_nl_F,             // Заключний стан для \n

        // 5. Заключний стан помилки
        q_ERR_F
    }
}
